add rules
