--- a/README.md
+++ b/README.md
@@ -1,52 +1,31 @@
 #### Clear Code Structure
-```plantuml
-@startuml
-Component --> Hook: uses
-Hook --> Store: uses
-Hook --> Hook: uses
-Store --> ApiService: uses
-ApiService --> Helpers : uses
-Store --> Helpers : uses
-Hook --> Helpers : uses
-@enduml
-```
 
-```mermaid
-journey
@@
-		Friend barely gets passing marks: 2: Friend
-```
 
 ```mermaid
 sequenceDiagram
@@
+    participant Component
+    participant Hook
+    participant Store
+    participant ApiService
+    participant Helpers
+
+	Component->>Hook: uses
+	Hook->>Store: uses
+	Hook->>Hook: uses
+	Store->>ApiService: uses
+	ApiService->>Helpers : uses
+	Store->>Helpers : uses
+	Hook->>Helpers : uses
 ```
+
 #### Slash ở đằng sau BaseURL
+
